avrxml/AS6-Devices-XML/ATSAM3U1E.xml
        <register caption="UDPHS Interrupt Enable Register" name="UDPHS_IEN" offset="0x10" rw="RW" size="4">
          <bitfield caption="Suspend Interrupt Enable" mask="0x00000002" name="DET_SUSPD"/>
          <bitfield caption="Micro-SOF Interrupt Enable" mask="0x00000004" name="MICRO_SOF"/>
          <bitfield caption="SOF Interrupt Enable" mask="0x00000008" name="INT_SOF"/>
          <bitfield caption="End Of Reset Interrupt Enable" mask="0x00000010" name="ENDRESET"/>
          <bitfield caption="Wake Up CPU Interrupt Enable" mask="0x00000020" name="WAKE_UP"/>
          <bitfield caption="End Of Resume Interrupt Enable" mask="0x00000040" name="ENDOFRSM"/>
          <bitfield caption="Upstream Resume Interrupt Enable" mask="0x00000080" name="UPSTR_RES"/>
          <bitfield caption="Endpoint 0 Interrupt Enable" mask="0x00000100" name="EPT_0"/>
          <bitfield caption="Endpoint 1 Interrupt Enable" mask="0x00000200" name="EPT_1"/>
          <bitfield caption="Endpoint 2 Interrupt Enable" mask="0x00000400" name="EPT_2"/>
          <bitfield caption="Endpoint 3 Interrupt Enable" mask="0x00000800" name="EPT_3"/>
          <bitfield caption="Endpoint 4 Interrupt Enable" mask="0x00001000" name="EPT_4"/>
          <bitfield caption="Endpoint 5 Interrupt Enable" mask="0x00002000" name="EPT_5"/>
          <bitfield caption="Endpoint 6 Interrupt Enable" mask="0x00004000" name="EPT_6"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Enable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Enable" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="UDPHS Interrupt Status Register" name="UDPHS_INTSTA" offset="0x14" rw="R" size="4">
          <bitfield caption="Speed Status" mask="0x00000001" name="SPEED"/>
          <bitfield caption="Suspend Interrupt" mask="0x00000002" name="DET_SUSPD"/>
          <bitfield caption="Micro Start Of Frame Interrupt" mask="0x00000004" name="MICRO_SOF"/>
          <bitfield caption="Start Of Frame Interrupt" mask="0x00000008" name="INT_SOF"/>
          <bitfield caption="End Of Reset Interrupt" mask="0x00000010" name="ENDRESET"/>
          <bitfield caption="Wake Up CPU Interrupt" mask="0x00000020" name="WAKE_UP"/>
          <bitfield caption="End Of Resume Interrupt" mask="0x00000040" name="ENDOFRSM"/>
          <bitfield caption="Upstream Resume Interrupt" mask="0x00000080" name="UPSTR_RES"/>
          <bitfield caption="Endpoint 0 Interrupt" mask="0x00000100" name="EPT_0"/>
          <bitfield caption="Endpoint 1 Interrupt" mask="0x00000200" name="EPT_1"/>
          <bitfield caption="Endpoint 2 Interrupt" mask="0x00000400" name="EPT_2"/>
          <bitfield caption="Endpoint 3 Interrupt" mask="0x00000800" name="EPT_3"/>
          <bitfield caption="Endpoint 4 Interrupt" mask="0x00001000" name="EPT_4"/>
          <bitfield caption="Endpoint 5 Interrupt" mask="0x00002000" name="EPT_5"/>
          <bitfield caption="Endpoint 6 Interrupt" mask="0x00004000" name="EPT_6"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
        </register>
        <register caption="UDPHS Clear Interrupt Register" name="UDPHS_CLRINT" offset="0x18" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Clear" mask="0x00000002" name="DET_SUSPD"/>
          <bitfield caption="Micro Start Of Frame Interrupt Clear" mask="0x00000004" name="MICRO_SOF"/>
          <bitfield caption="Start Of Frame Interrupt Clear" mask="0x00000008" name="INT_SOF"/>
          <bitfield caption="End Of Reset Interrupt Clear" mask="0x00000010" name="ENDRESET"/>
          <bitfield caption="Wake Up CPU Interrupt Clear" mask="0x00000020" name="WAKE_UP"/>
          <bitfield caption="End Of Resume Interrupt Clear" mask="0x00000040" name="ENDOFRSM"/>
          <bitfield caption="Upstream Resume Interrupt Clear" mask="0x00000080" name="UPSTR_RES"/>
        </register>
        <register caption="UDPHS Endpoints Reset Register" name="UDPHS_EPTRST" offset="0x1C" rw="W" size="4">
          <bitfield caption="Endpoint 0 Reset" mask="0x00000001" name="EPT_0"/>
          <bitfield caption="Endpoint 1 Reset" mask="0x00000002" name="EPT_1"/>
          <bitfield caption="Endpoint 2 Reset" mask="0x00000004" name="EPT_2"/>
          <bitfield caption="Endpoint 3 Reset" mask="0x00000008" name="EPT_3"/>
          <bitfield caption="Endpoint 4 Reset" mask="0x00000010" name="EPT_4"/>
          <bitfield caption="Endpoint 5 Reset" mask="0x00000020" name="EPT_5"/>
          <bitfield caption="Endpoint 6 Reset" mask="0x00000040" name="EPT_6"/>
        </register>
        <register caption="UDPHS Test Register" name="UDPHS_TST" offset="0xE0" rw="RW" size="4">
          <bitfield caption="Speed Configuration" mask="0x00000003" name="SPEED_CFG" values="UDPHS_TST__SPEED_CFG"/>
          <bitfield caption="Test J Mode" mask="0x00000004" name="TST_J"/>
          <bitfield caption="Test K Mode" mask="0x00000008" name="TST_K"/>
          <bitfield caption="Test Packet Mode" mask="0x00000010" name="TST_PKT"/>
          <bitfield caption="OpMode2" mask="0x00000020" name="OPMODE2"/>
        </register>
        <register caption="UDPHS Name1 Register" name="UDPHS_IPNAME1" offset="0xF0" rw="R" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="IP_NAME1"/>
        </register>
        <register caption="UDPHS Name2 Register" name="UDPHS_IPNAME2" offset="0xF4" rw="R" size="4">
          <bitfield caption="" mask="0xFFFFFFFF" name="IP_NAME2"/>
        </register>
        <register caption="UDPHS Features Register" name="UDPHS_IPFEATURES" offset="0xF8" rw="R" size="4">
          <bitfield caption="Max Number of Endpoints" mask="0x0000000F" name="EPT_NBR_MAX"/>
          <bitfield caption="Number of DMA Channels" mask="0x00000070" name="DMA_CHANNEL_NBR"/>
          <bitfield caption="DMA Buffer Size" mask="0x00000080" name="DMA_B_SIZ"/>
          <bitfield caption="DMA FIFO Depth in Words" mask="0x00000F00" name="DMA_FIFO_WORD_DEPTH"/>
          <bitfield caption="DPRAM Size" mask="0x00007000" name="FIFO_MAX_SIZE"/>
          <bitfield caption="DPRAM Byte Write Capability" mask="0x00008000" name="BW_DPRAM"/>
          <bitfield caption="UTMI DataBus16_8" mask="0x00010000" name="DATAB16_8"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00020000" name="ISO_EPT_1"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00040000" name="ISO_EPT_2"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00080000" name="ISO_EPT_3"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00100000" name="ISO_EPT_4"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00200000" name="ISO_EPT_5"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00400000" name="ISO_EPT_6"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x00800000" name="ISO_EPT_7"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x01000000" name="ISO_EPT_8"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x02000000" name="ISO_EPT_9"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x04000000" name="ISO_EPT_10"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x08000000" name="ISO_EPT_11"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x10000000" name="ISO_EPT_12"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x20000000" name="ISO_EPT_13"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x40000000" name="ISO_EPT_14"/>
          <bitfield caption="Endpointx High Bandwidth Isochronous Capability" mask="0x80000000" name="ISO_EPT_15"/>
        </register>
        <register caption="UDPHS Endpoint Configuration Register (endpoint = 0)" name="UDPHS_EPTCFG0" offset="0x100" rw="RW" size="4">
          <bitfield caption="Endpoint Size" mask="0x00000007" name="EPT_SIZE" values="UDPHS_EPTCFG0__EPT_SIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000008" name="EPT_DIR"/>
          <bitfield caption="Endpoint Type" mask="0x00000030" name="EPT_TYPE" values="UDPHS_EPTCFG0__EPT_TYPE"/>
          <bitfield caption="Number of Banks" mask="0x000000C0" name="BK_NUMBER" values="UDPHS_EPTCFG0__BK_NUMBER"/>
          <bitfield caption="Number Of Transaction per Microframe" mask="0x00000300" name="NB_TRANS"/>
          <bitfield caption="Endpoint Mapped" mask="0x80000000" name="EPT_MAPD"/>
        </register>
        <register caption="UDPHS Endpoint Control Enable Register (endpoint = 0)" name="UDPHS_EPTCTLENB0" offset="0x104" rw="W" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="DATAx Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)" mask="0x00000040" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints)" mask="0x00000080" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Enable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enable" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enable" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Enable" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Enable" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent /ISO CRC Error/Number of Transaction Error Interrupt Enable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent /ISO CRC Error/Number of Transaction Error Interrupt Enable" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent /ISO CRC Error/Number of Transaction Error Interrupt Enable" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/Bank Flush Error Interrupt Enable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/Bank Flush Error Interrupt Enable" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Interrupt Enable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Send/Short Packet Interrupt Enable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Disable Register (endpoint = 0)" name="UDPHS_EPTCTLDIS0" offset="0x108" rw="W" size="4">
          <bitfield caption="Endpoint Disable" mask="0x00000001" name="EPT_DISABL"/>
          <bitfield caption="Packet Auto-Valid Disable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Enable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="DATAx Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000040" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000080" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Disable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Disable" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Disable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Disable" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Disable" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Disable" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Disable" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/bank flush error Interrupt Disable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/bank flush error Interrupt Disable" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Interrupt Disable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Disable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Register (endpoint = 0)" name="UDPHS_EPTCTL0" offset="0x10C" rw="R" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enabled (Not for CONTROL Endpoints)" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupt Disables DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000040" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000080" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Enabled" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enabled" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enabled" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enabled" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enabled" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Enabled" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Enabled" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Enabled" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Enabled" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Enabled" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/Bank Flush Error Interrupt Enabled" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/Bank Flush Error Interrupt Enabled" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Interrupt Enabled" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enabled" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Enabled" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Set Status Register (endpoint = 0)" name="UDPHS_EPTSETSTA0" offset="0x114" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Set" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="KILL Bank Set (for IN Endpoint)" mask="0x00000200" name="KILL_BANK"/>
          <bitfield caption="TX Packet Ready Set" mask="0x00000800" name="TX_PK_RDY"/>
        </register>
        <register caption="UDPHS Endpoint Clear Status Register (endpoint = 0)" name="UDPHS_EPTCLRSTA0" offset="0x118" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Clear" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Data Toggle Clear" mask="0x00000040" name="TOGGLESQ"/>
          <bitfield caption="Received OUT Data Clear" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Clear" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="Received SETUP/Error Flow Clear" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Clear" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/Number of Transaction Error Clear" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/Number of Transaction Error Clear" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/Bank Flush Error Clear" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/Bank Flush Error Clear" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Clear" mask="0x00008000" name="NAK_OUT"/>
        </register>
