avrxml/AS6-Devices-XML/ATSAM3U1E.xml
        <register offset="0x00000d10" size="4" name="SCR" initval="0" caption="System Control Register">
          <bitfield mask="0x00000002" name="SLEEPONEXIT" values="SLEEPONEXIT" caption="no description available"/>
          <bitfield mask="0x00000004" name="SLEEPDEEP" values="SLEEPDEEP" caption="no description available"/>
          <bitfield mask="0x00000010" name="SEVONPEND" values="SEVONPEND" caption="no description available"/>
        </register>
        <register offset="0x00000d14" size="4" name="CCR" initval="0" caption="Configuration and Control Register">
          <bitfield mask="0x00000001" name="NONBASETHRDENA" values="NONBASETHRDENA" caption="no description available"/>
          <bitfield mask="0x00000002" name="USERSETMPEND" values="USERSETMPEND" caption="Enables unprivileged software access to the STIR"/>
          <bitfield mask="0x00000008" name="UNALIGN_TRP" values="UNALIGN_TRP" caption="Enables unaligned access traps"/>
          <bitfield mask="0x00000010" name="DIV_0_TRP" values="DIV_0_TRP" caption="Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0"/>
          <bitfield mask="0x00000100" name="BFHFNMIGN" values="BFHFNMIGN" caption="Enables handlers with priority -1 or -2 to ignore data BusFaults caused by load and store instructions."/>
          <bitfield mask="0x00000200" name="STKALIGN" values="STKALIGN" caption="Indicates stack alignment on exception entry"/>
        </register>
        <register offset="0x00000d18" size="4" name="SHPR1" initval="0" caption="System Handler Priority Register 1">
          <bitfield mask="0x000000ff" name="PRI_4" caption="Priority of system handler 4, MemManage"/>
          <bitfield mask="0x0000ff00" name="PRI_5" caption="Priority of system handler 5, BusFault"/>
          <bitfield mask="0x00ff0000" name="PRI_6" caption="Priority of system handler 6, UsageFault"/>
        </register>
        <register offset="0x00000d1c" size="4" name="SHPR2" initval="0" caption="System Handler Priority Register 2">
          <bitfield mask="0xff000000" name="PRI_11" caption="Priority of system handler 11, SVCall"/>
        </register>
        <register offset="0x00000d20" size="4" name="SHPR3" initval="0" caption="System Handler Priority Register 3">
          <bitfield mask="0x00ff0000" name="PRI_14" caption="Priority of system handler 14, PendSV"/>
          <bitfield mask="0xff000000" name="PRI_15" caption="Priority of system handler 15, SysTick exception"/>
        </register>
        <register offset="0x00000d24" size="4" name="SHCSR" initval="0" caption="System Handler Control and State Register">
          <bitfield mask="0x00000001" name="MEMFAULTACT" values="MEMFAULTACT" caption="no description available"/>
          <bitfield mask="0x00000002" name="BUSFAULTACT" values="BUSFAULTACT" caption="no description available"/>
          <bitfield mask="0x00000008" name="USGFAULTACT" values="USGFAULTACT" caption="no description available"/>
          <bitfield mask="0x00000080" name="SVCALLACT" values="SVCALLACT" caption="no description available"/>
          <bitfield mask="0x00000100" name="MONITORACT" values="MONITORACT" caption="no description available"/>
          <bitfield mask="0x00000400" name="PENDSVACT" values="PENDSVACT" caption="no description available"/>
          <bitfield mask="0x00000800" name="SYSTICKACT" values="SYSTICKACT" caption="no description available"/>
          <bitfield mask="0x00001000" name="USGFAULTPENDED" values="USGFAULTPENDED" caption="no description available"/>
          <bitfield mask="0x00002000" name="MEMFAULTPENDED" values="MEMFAULTPENDED" caption="no description available"/>
          <bitfield mask="0x00004000" name="BUSFAULTPENDED" values="BUSFAULTPENDED" caption="no description available"/>
          <bitfield mask="0x00008000" name="SVCALLPENDED" values="SVCALLPENDED" caption="no description available"/>
          <bitfield mask="0x00010000" name="MEMFAULTENA" values="MEMFAULTENA" caption="no description available"/>
          <bitfield mask="0x00020000" name="BUSFAULTENA" values="BUSFAULTENA" caption="no description available"/>
          <bitfield mask="0x00040000" name="USGFAULTENA" values="USGFAULTENA" caption="no description available"/>
        </register>
        <register offset="0x00000d28" size="4" name="CFSR" initval="0" caption="Configurable Fault Status Registers">
          <bitfield mask="0x00000001" name="IACCVIOL" values="IACCVIOL" caption="no description available"/>
          <bitfield mask="0x00000002" name="DACCVIOL" values="DACCVIOL" caption="no description available"/>
          <bitfield mask="0x00000008" name="MUNSTKERR" values="MUNSTKERR" caption="no description available"/>
          <bitfield mask="0x00000010" name="MSTKERR" values="MSTKERR" caption="no description available"/>
          <bitfield mask="0x00000020" name="MLSPERR" values="MLSPERR" caption="no description available"/>
          <bitfield mask="0x00000080" name="MMARVALID" values="MMARVALID" caption="no description available"/>
          <bitfield mask="0x00000100" name="IBUSERR" values="IBUSERR" caption="no description available"/>
          <bitfield mask="0x00000200" name="PRECISERR" values="PRECISERR" caption="no description available"/>
          <bitfield mask="0x00000400" name="IMPRECISERR" values="IMPRECISERR" caption="no description available"/>
          <bitfield mask="0x00000800" name="UNSTKERR" values="UNSTKERR" caption="no description available"/>
          <bitfield mask="0x00001000" name="STKERR" values="STKERR" caption="no description available"/>
          <bitfield mask="0x00002000" name="LSPERR" values="LSPERR" caption="no description available"/>
          <bitfield mask="0x00008000" name="BFARVALID" values="BFARVALID" caption="no description available"/>
          <bitfield mask="0x00010000" name="UNDEFINSTR" values="UNDEFINSTR" caption="no description available"/>
          <bitfield mask="0x00020000" name="INVSTATE" values="INVSTATE" caption="no description available"/>
          <bitfield mask="0x00040000" name="INVPC" values="INVPC" caption="no description available"/>
          <bitfield mask="0x00080000" name="NOCP" values="NOCP" caption="no description available"/>
          <bitfield mask="0x01000000" name="UNALIGNED" values="UNALIGNED" caption="no description available"/>
          <bitfield mask="0x02000000" name="DIVBYZERO" values="DIVBYZERO" caption="no description available"/>
        </register>
        <register offset="0x00000d2c" size="4" name="HFSR" initval="0" caption="HardFault Status register">
          <bitfield mask="0x00000002" name="VECTTBL" values="VECTTBL" caption="no description available"/>
          <bitfield mask="0x40000000" name="FORCED" values="FORCED" caption="no description available"/>
          <bitfield mask="0x80000000" name="DEBUGEVT" caption="no description available"/>
        </register>
        <register offset="0x00000d30" size="4" name="DFSR" initval="0" caption="Debug Fault Status Register">
          <bitfield mask="0x00000001" name="HALTED" values="HALTED" caption="no description available"/>
          <bitfield mask="0x00000002" name="BKPT" values="BKPT" caption="no description available"/>
          <bitfield mask="0x00000004" name="DWTTRAP" values="DWTTRAP" caption="no description available"/>
          <bitfield mask="0x00000008" name="VCATCH" values="VCATCH" caption="no description available"/>
          <bitfield mask="0x00000010" name="EXTERNAL" values="EXTERNAL" caption="no description available"/>
        </register>
        <register offset="0x00000d34" size="4" name="MMFAR" initval="0" caption="MemManage Address Register">
          <bitfield mask="0xffffffff" name="ADDRESS" caption="Address of MemManage fault location"/>
        </register>
        <register offset="0x00000d38" size="4" name="BFAR" initval="0" caption="BusFault Address Register">
          <bitfield mask="0xffffffff" name="ADDRESS" caption="Address of the BusFault location"/>
        </register>
        <register offset="0x00000d3c" size="4" name="AFSR" initval="0" caption="Auxiliary Fault Status Register">
          <bitfield mask="0xffffffff" name="AUXFAULT" caption="Latched version of the AUXFAULT inputs"/>
        </register>
      </register-group>
      <value-group name="RETTOBASE">
        <value value="0" name="VALUE_0" caption="there are preempted active exceptions to execute"/>
        <value value="1" name="VALUE_1" caption="there are no active exceptions, or the currently-executing exception is the only active exception"/>
      </value-group>
      <value-group name="ISRPREEMPT">
        <value value="0" name="VALUE_0" caption="Will not service"/>
        <value value="1" name="VALUE_1" caption="Will service a pending exception"/>
      </value-group>
      <value-group name="PENDSTCLR">
        <value value="0" name="VALUE_0" caption="no effect"/>
        <value value="1" name="VALUE_1" caption="removes the pending state from the SysTick exception"/>
      </value-group>
